; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=31, remove_proportion=0.101, bases=12, instance_id=8, output=./training, seed=49

(define (problem warehouse-08)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 - base
    )
    (:init
        (to-remove box3)
        (to-remove box12)
        (to-remove box14)
        (clear box5)
        (on box5 box23)
        (on box23 box7)
        (on box7 box13)
        (on-base box13 base1)
        (clear box27)
        (on box27 box1)
        (on-base box1 base2)
        (clear box10)
        (on box10 box26)
        (on-base box26 base3)
        (clear box24)
        (on box24 box17)
        (on-base box17 base4)
        (clear box19)
        (on box19 box9)
        (on-base box9 base5)
        (clear box2)
        (on box2 box21)
        (on box21 box31)
        (on-base box31 base6)
        (clear box22)
        (on box22 box28)
        (on box28 box30)
        (on-base box30 base7)
        (clear box11)
        (on-base box11 base8)
        (clear box15)
        (on box15 box3)
        (on box3 box16)
        (on box16 box4)
        (on-base box4 base9)
        (clear box18)
        (on box18 box20)
        (on-base box20 base10)
        (clear box6)
        (on box6 box14)
        (on-base box14 base11)
        (clear box8)
        (on box8 box12)
        (on box12 box25)
        (on box25 box29)
        (on-base box29 base12)
    )
    (:goal (and 
        (removed box3)
        (removed box12)
        (removed box14)
    ))
)

; plan
1. (move box15 box3 box10)
   deleted: (clear box10) (on box15 box3)
   added: (on box15 box10) (clear box3)
   goals met: 0 of 3
2. (move box6 box14 box11)
   deleted: (clear box11) (on box6 box14)
   added: (on box6 box11) (clear box14)
   goals met: 0 of 3
3. (remove-from-base box14 base11)
   deleted: (on-base box14 base11) (clear box14)
   added: (removed box14) (clear-base base11)
   goals met: 1 of 3
4. (move box8 box12 box15)
   deleted: (clear box15) (on box8 box12)
   added: (on box8 box15) (clear box12)
   goals met: 1 of 3
5. (remove box12 box25)
   deleted: (on box12 box25) (clear box12)
   added: (removed box12) (clear box25)
   goals met: 2 of 3
6. (remove box3 box16)
   deleted: (on box3 box16) (clear box3)
   added: (removed box3) (clear box16)
   goals met: 3 of 3
